// Задача 66: Задайте значения M и N. Напишите программу, 
// которая найдёт сумму натуральных элементов в промежутке от M до N.

// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30
//------------------------------Решение----------------------------------

int SumElemens(int m, int n)
{
              if (n == m)
              {
                return m;            
              }
              return n + SumElemens(m,n - 1); 
}
//---------------------Вызов функции------------------------------------
int sum = SumElemens(4,8);
System.Console.WriteLine(sum);